using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Villas_Nexus.Models
{
    public class Menu
    {

        protected void ToonTitel(string titel)
        {
            Console.Clear();
            Console.WriteLine(                 
                   "██╗   ██╗ █████╗ ██╗     ██╗     ██╗███████╗\r\n" +
                   "██║   ██║██╔══██╗██║     ██║     ██║██╔════╝\r\n" +
                   "██║   ██║███████║██║     ██║     ██║███████╗\r\n" +
                   "╚██╗ ██╔╝██╔══██║██║     ██║     ██║╚════██║\r\n" +
                   " ╚████╔╝ ██║  ██║███████╗███████╗██║███████║\r\n" +
                   "  ╚═══╝  ╚═╝  ╚═╝╚══════╝╚══════╝╚═╝╚══════╝\r\n" +
                   "                                            \r\n" +
                   "███╗   ██╗███████╗██╗  ██╗██╗   ██╗███████╗ \r\n" +
                   "████╗  ██║██╔════╝╚██╗██╔╝██║   ██║██╔════╝ \r\n" +
                   "██╔██╗ ██║█████╗   ╚███╔╝ ██║   ██║███████╗ \r\n" +
                   "██║╚██╗██║██╔══╝   ██╔██╗ ██║   ██║╚════██║ \r\n" +
                   "██║ ╚████║███████╗██╔╝ ██╗╚██████╔╝███████║ \r\n" +
                   "╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝ ╚═════╝ ╚══════╝ \r\n" +
                   $"{titel} \r\n");
        }

        public virtual void ToonMenu()
        {

            Console.WriteLine("Menu");

        }

       
        }
    }


